#+BEGIN_HTML
---
layout: notes
---
#+END_HTML
#+TOC: headlines 4

* Data types

   + ~char~ :: a single byte. A character written between single
               quotes represents an integer value equal to the
               numerical value of the character in the machine’s
               character set. It is called a /character constant/. It
               is another way to write a small integer. ~char~
               variables and constants are identical to ~int~ in
               arithmetic expressions. With ASCII, ~A~ value is 65,
               ~0~ value is 48 etc.

               #+BEGIN_SRC C
                 if (c >= '0' && c <= '9')
               #+END_SRC

               Determines whether the character in ~c~ is a digit. The
               numeric value of that digit is
               #+BEGIN_SRC C
                 c - '0'
               #+END_SRC
               Because the values of ~0~, ~1~, etc. form a contiguous
               increasing sequence.

   + ~int~ :: at least 16 bits (-32768 and +32767). 32 bits on some
              machine. An integer can be represented in octal with a
              leading ~0~. A leading ~0x~ means hexadecimal
   + ~short~ or ~short int~ :: short integer. Often 16 bits
   + ~long~ or ~long int~ :: at least 32 bits. Often 32 bits
   + ~float~ :: single-precision floating point
   + ~double~ :: double-precision floating point

   ~signed~ or ~unsigned~ can be applied to ~char~ or ~integer~.
   ~unsigned~ numbers are always positive  or zero and obey the laws
   of arithmetic modulo 2^n. So if /chars/ are 8 bits, ~unsigned char~
   variables have values between 0 and 255 (2^8 = 256). ~signed char~
   variables have values between -128 and 127.

   ~%~ cannot be applied to ~float~ or ~double~.

   Integer division truncates.

   #+BEGIN_SRC C :exports both
     float f = 5/2;
     printf("%f", f);
   #+END_SRC

   #+RESULTS:
   : 2.0

   #+BEGIN_SRC C
   n1 = nw = nc = 0;
   #+END_SRC

   Sets all variables to 0 because assignment is an expression with a value.

   By convention, a string constant ends with ~\0~ to mark the end.

   Type conversions can be forced (/coerced/) with an unary operator
   called a cast.

   #+BEGIN_SRC C
     sqrt((double) n)
   #+END_SRC

* ~++~ and ~--~
    To decrement ~--n~ and increment ~++n~ by 1. More concise and often efficient
    than ~n = n + 1~

    They can be used as prefix (~++n~) and postfix operators (~n++~).
    ~++n~ increments before the value is used

    #+BEGIN_SRC C :exports both
      int n = 5;
      int m = 5;

      printf("%d, %d", ++n, m++);
    #+END_SRC

    #+RESULTS:
    | 6 | 5 |

** ~printf~ & ~scanf~

    First argument is a string of characters to be printed. Each ~%~
    indicating where one of the other arguments is to be substituted.

    #+BEGIN_SRC C
      printf("%d\t%d\n", 93, 24);
    #+END_SRC

    #+RESULTS:
    | 93 | 24 |


    Parameters examples
   + ~%d~ :: decimal integer
   + ~%6d~ :: decimal integer, 6 characters wide
   + ~f~ :: float
   + ~%6.2f~ :: float with 2 characters after decimal point and 6
                characters wide

   ~scanf~ is like ~printf~ except that it reads input instead of
   writing output.
* String
  #+BEGIN_SRC C :exports both
    char string[] = "I’m a string";
    char another_string[] = "I’m " "a string";
    printf("%s", another_string);
  #+END_SRC

  #+RESULTS:
  : I’m a string

  null character ~\0~ at the end

** ~if~
   #+BEGIN_SRC C :exports both
     int x = 6;
     if (x > 10)
       printf("large x");
      else  if (x > 5)
        printf("small x");
      else
        printf("tiny x");
   #+END_SRC

   #+RESULTS:
   : small x

** ~switch~
   As a matter of good form we put a ~break~ after the last case even
   though it is unnecessary.

   #+BEGIN_SRC C :exports both
     int c = 'a';

     switch(c) {
      case 'a':
        printf("this is a");
        break;
      case 'b': case 'c': case 'd':
        printf("not a");
        break;
      default:
        break;
      }

   #+END_SRC

   #+RESULTS:
   : this is a

   The ~break~ statements cause an immediate exit from the ~switch~.

* Pointers and Arrays
  A pointer is a variable that contains the address of a variable.
  The addition and subtraction of two pointers is illegal.

  The unary operator ~&~ gives the address of an object. ~&~ only
  applies to objects in memory: variables and array elements.
  #+BEGIN_SRC C
    p = &c;
  #+END_SRC

  The adress of ~c~ is the variable ~p~ and p is said to /point to/ ~c~.

  The unary operator ~*~ is the /indirection/ or /de-referencing/
  operator. When applied to a pointer it accesses the object the
  pointer points to.

  A pointer to ~void~ is used to hold any type of pointer but cannot
  be de-referenced itself

  #+BEGIN_SRC C :exports both
    int x = 1, y = 2, z[10];
    int *ip, *iq;
    ip = &x;
    printf("%i\n", *ip);

    y = *ip;
    printf("%i\n", y);

    ,*ip = 0;
    printf("%i\n", x);

    z[0] = 9;

    ip = &z[0];
    printf("%i\n", *ip);

    ,*ip += 1;
    printf("%i\n", *ip);

    ++*ip;
    printf("%i\n", *ip);

    z[1] = 3;
    ,*ip++; // careful here, you increment ip, not what it points to
    printf("%i\n", *ip);

    (*ip)++;
    printf("%i\n", *ip);

    iq = ip; // making iq points to whatever ip points to
  #+END_SRC

  #+RESULTS:
  |  1 |
  |  1 |
  |  0 |
  |  9 |
  | 10 |
  | 11 |
  |  3 |
  |  4 |


  You can use pointers to have function parameters changed by
  functions.

  #+BEGIN_SRC C
    void swap(int *px, int *py)
    {
      temp = *px;
      *px = *py;
      *py = temp;
    }

    swap(&a, &b); // & produces the address of a bariable, so &a is a pointer to a
  #+END_SRC

  The constant zero may be assigned to a pointer, and a pointer can be
  compared to zero. The Symbolic constant ~NULL~ is often used in
  place of zero.

  Common idiom:
  #+BEGIN_SRC C
    // copy t to s
    void strcpy(char *s, char *t)
    {
      while (*s++ = *t++)
        ;
    }
  #+END_SRC

  Copies two strings, works because, strings ends with ~\0~ in C, So
  the loop will continue as long as ~\0~ in t has not been reached.

  #+BEGIN_SRC C
    *p++ = val; // push val on stack
    val = *--p  // pop top of stack into val
                // (decrements p before fetching the character that p points to)
  #+END_SRC

* Structures
  A ~struct~ declaration defines a type

  #+BEGIN_SRC C :exports both
    struct point {
      int x;
      int y;
    } x, y , z;

    struct point maxpt = { 320, 200 };

    printf("%d, %d", maxpt.x, maxpt.y);
  #+END_SRC

  #+RESULTS:
  | 320 | 200 |

  With a large structure, it is generally more efficient to pass a
  pointer.

  #+BEGIN_SRC C
    struct point *pp;
    pp->x = 300;
    pp-> y = 200;
  #+END_SRC

  Example of a tree
  #+BEGIN_SRC C
    struct tnode {
      char *word;
      int count;
      struct tnode *left;
      struct tnode *right;
    };
  #+END_SRC

* ~sizeof~

  Can be used to compute the size of any object.

  #+BEGIN_SRC C :exports both
    int x = 3;
    printf("%d\n", sizeof x);
    printf("%d", sizeof(int));
  #+END_SRC

  #+RESULTS:
  | 4 |
  | 4 |

